app/controllers/microsofts_controller.rb

  def index
    @microsofts = Microsoft.all
---
SELECT * FROM "microsofts"

  def show
    @microsoft = Microsoft.find(params[:id])
---
SELECT * FROM "microsofts" WHERE ("microsofts"."id" = 1)

  def create
    @microsoft = Microsoft.new(params[:microsoft])

    respond_to do |format|
      if @microsoft.save
---
INSERT INTO "microsofts" ("content", "user_id", "created_at", "updated_at") VALUES('test1', 1, '2010-06-26 03:53:37', '2010-06-26 03:53:37')